class MasterData {
  static projectIndicator_activities = [
    {
      "id": 1,
      "name": "คะแนนประเมินรัฐวิสาหกิจ",
      "cal_type": "คะแนน"
    },
    {
      "id": 2,
      "name": "คะแนนประเมิน Core Business Enablers",
      "cal_type": "คะแนน"
    },
    {
      "id": 3,
      "name": "คะแนน Digital Maturity Level",
      "cal_type": "คะแนน"
    },
    {
      "id": 4,
      "name": "สัดส่วนจำนวนของแผนงานที่สำคัญขององค์กรที่สามารถดำเนินงานได้ตามเป้าหมาย",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 5,
      "name": "ร้อยละความสำเร็จของการพัฒนาแพลตฟอร์มกลางสำหรับระบบสารสนเทศและข้อมูลของหน่วยงานที่เกี่ยวข้อง\nให้สามารถทำงานและประมวลผลร่วมกัน",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 6,
      "name": "คะแนนประเมินสมรรถนะ (Competency)",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 7,
      "name": "Emplyee Net Promoter Score ไม่น้อยกว่า",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 8,
      "name": "ค่าใช้จ่ายที่ลดลงจากการใช้นวัตกรรม/เทคโนโลยี",
      "cal_type": "บาท"
    },
    {
      "id": 9,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนปฏิบัติการดิจิทัลของ ททท.",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 10,
      "name": "สัดส่วนจำนวนกระบวนการที่ดำเนินการได้ตาม SLA",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 11,
      "name": "ร้อยละจำนวนแผนงาน/โครงการที่ร่วมกับหน่วยงานภายนอกสำเร็จ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 12,
      "name": "ระดับความพึงพอใจของผู้มีส่วนได้ส่วนเสีย ไม่ต่ำกว่า 4 คะแนน",
      "cal_type": "คะแนน"
    },
    {
      "id": 13,
      "name": "ระดับความสำเร็จของการดำเนินงานด้าน Eco-efficiency",
      "cal_type": "ระดับ"
    },
    {
      "id": 14,
      "name": "คะแนนประเมิน Core Business Enablers ด้าน CG SP RM และ IA",
      "cal_type": "คะแนน"
    },
    {
      "id": 15,
      "name": "ระดับความพึงพอใจต่อการใช้ข้อมูลและการใช้ระบบด้านการท่องเที่ยวและระบบคลังข้อมูลของผู้มีส่วนได้ส่วนเสีย",
      "cal_type": "คะแนน"
    },
    {
      "id": 16,
      "name": "ร้อยละความสำเร็จของการบริหารจัดการข้อมูลด้านการท่องเที่ยวและระบบคลังข้อมูลของ ททท. ตามเป้าหมาย\nที่วางไว้ในแต่ละปี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 17,
      "name": "ระดับความพึงพอใจของผู้ใช้ข้อมูลภายนอก",
      "cal_type": "คะแนน"
    },
    {
      "id": 18,
      "name": "ระดับความพึงพอใจของผู้ใช้ข้อมูลภายใน ททท.",
      "cal_type": "คะแนน"
    },
    {
      "id": 19,
      "name": "ร้อยละความสำเร็จของโครงการ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 20,
      "name": "ร้อยละของจำนวนโครงการที่ดำเนินงานได้ตามแผนการลงทุนเพื่อพัฒนายกระดับการท่องเที่ยว",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 21,
      "name": "ร้อยละความสำเร็จในการวางแผนการลงทุนเพื่อพัฒนายกระดับการท่องเที่ยว",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 22,
      "name": "ร้อยละของตำแหน่งสำคัญที่แต่งตั้งจากบุคลากรที่เป็น Successor",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 23,
      "name": "คะแนนประเมิน Core Business Enablers ด้านการบริหารทุนมนุษย์",
      "cal_type": "คะแนน"
    },
    {
      "id": 24,
      "name": "คะแนนประเมิน Core Business Enablers ด้านการจัดการความรู้",
      "cal_type": "คะแนน"
    },
    {
      "id": 25,
      "name": "ร้อยละของจำนวนบุคลากรที่ดำเนินการตามแผนพัฒนาบุคลากรรายบุคคล (IDP)",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 26,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนบริหารและพัฒนาด้านทรัพยากรบุคคล ททท.",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 27,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการจัดการความรู้ ททท.",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 28,
      "name": "คะแนนประเมิน Core Business Enablers ด้านการพัฒนาเทคโนโลยีดิจิทัล",
      "cal_type": "คะแนน"
    },
    {
      "id": 29,
      "name": "ททท. ผ่านการตรวจประเมินเพื่อติดตามการรักษามาตรฐาน ISO 27001: 2013",
      "cal_type": "ระบบ"
    },
    {
      "id": 30,
      "name": "ร้อยละความสำเร็จของการทบทวนแผนปฏิบัติการดิจิทัลของ ททท.",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 31,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนการปรับปรุงที่ได้ผลจากการทบทวนบทบาท หน้าที่ ความรับผิดชอบ และอัตรากำลัง",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 32,
      "name": "จำนวนนวัตกรรมที่นำมาใช้จริง",
      "cal_type": "ชิ้น"
    },
    {
      "id": 33,
      "name": "คะแนนประเมิน Core Business Enablers ด้านการบริหารจัดการนวัตกรรม",
      "cal_type": "คะแนน"
    },
    {
      "id": 34,
      "name": "ร้อยละความสำเร็จในการปรับปรุงกระบวนการทำงาน",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 35,
      "name": "ร้อยละความสำเร็จในการศึกษาและ/หรือทบทวนบทบาท หน้าที่ ความรับผิดชอบ และ อัตรากำลัง",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 36,
      "name": "ร้อยละความสำเร็จของการจัดทำ SLA ของกระบวนการสำคัญ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 37,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการเสริมสร้างนวัตกรรมทางการท่องเที่ยว",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 38,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทแลแผนปฏิบัติการสื่อสารภายในองค์กร",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 39,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนด้านความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมระยะยาว",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 40,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามโครงการตามแผนองค์กรสมรรถนะสูง (HPO)",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 41,
      "name": "คะแนนประเมินผลสมรรถนะในระดับองค์กร (HPO)",
      "cal_type": "คะแนน"
    },
    {
      "id": 42,
      "name": "ร้อยละความสำเร็จของการจัดทำแผนองค์กรสมรรถนะสูง",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 43,
      "name": "ระดับความพึงพอใจของผู้มีส่วนได้ส่วนเสียที่ดำเนินแผนงาน/โครงการร่วมกับ ททท.",
      "cal_type": "คะแนน"
    },
    {
      "id": 44,
      "name": "คะแนนประเมินผล Core Business Enabler (ด้านการมุ่งเน้นผู้มีส่วนได้ส่วนเสีย)",
      "cal_type": "คะแนน"
    },
    {
      "id": 45,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนยุทธศาสตร์ด้านผู้มีส่วนได้ส่วนเสียระยะยาว",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 46,
      "name": "ร้อยละการรับรู้ของหน่วยงานภายในเกี่ยวกับแผนยุทธศาสตร์ด้านผู้มีส่วนได้ส่วนเสียระยะยาว",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 47,
      "name": "อัตราการรับรู้ภาพลักษณ์ขององค์กรในฐานะหน่วยงานที่มีความรับผิดชอบต่อสังคมและสิ่งแวดล้อม",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 48,
      "name": "ระดับความต้องการเข้ามามีส่วนร่วมในการดำเนินงานที่รับผิดชอบต่อสังคมและสิ่งแวดล้อมของบุคลากรภายในองค์กร",
      "cal_type": "คะแนน"
    },
    {
      "id": 49,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการแสดงความรับผิดชอบต่อสังคม",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 50,
      "name": "จำนวนผู้เข้าร่วมกิจกรรม CSR กับ ททท.",
      "cal_type": "คน-ครั้ง"
    },
    {
      "id": 51,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนของโครงการที่สำคัญ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 52,
      "name": "ร้อยละความสำเร็จของการจัดทำแผนปฏิบัติการของ ททท.",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 53,
      "name": "ร้อยละจำนวนบุคลากร ททท. ที่มีความรู้ความเข้าใจในเรื่องการบริหารความเสี่ยงและควบคุมภายใน",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 54,
      "name": "ททท. ผ่านการตรวจประเมิน เพื่อติดตามการรักษามาตรฐานระบบ ISO 22301",
      "cal_type": "ระบบ"
    },
    {
      "id": 55,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนตรวจสอบเชิงกลยุทธ์และแผนตรวจสอบประจำปี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 56,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผน Governance, Risk & Compliance (GRC)",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 57,
      "name": "ร้อยละการดำเนินงานตามแผนการบริหารความเสี่ยงและควบคุมภายใน",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 58,
      "name": "ร้อยละจำนวนกิจกรรมการถ่ายทอดความรู้ด้านการบริหารความเสี่ยงและควบคุมภายในที่ดำเนินการแล้วเสร็จ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 59,
      "name": "ร้อยละจำนวนหน่วยงานที่ดำเนินการซ้อมแผนบริหารความต่อเนื่องทางธุรกิจสำเร็จ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 60,
      "name": "ร้อยละความสำเร็จของการจัดทำ/ทบทวนแผนบริหารความเสี่ยงและควบคุมภายใน",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 61,
      "name": "ร้อยละความสำเร็จของการจัดทำแผนตรวจสอบเชิงกลยุทธ์ และแผนตรวจสอบประจำปี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 62,
      "name": "ร้อยละจำนวนบุคลากร ททท. ที่มีความรู้ความเข้าใจในเรื่องการกำกับดูแลกิจการที่ดี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 63,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการกำกับดูแลกิจการที่ดี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 64,
      "name": "คะแนนการประเมินคุณธรรม และความโปร่งใสในการดำเนินงาน ของ ททท. (ITA)",
      "cal_type": "คะแนน"
    },
    {
      "id": 65,
      "name": "ร้อยละจำนวนกิจกรรมการถ่ายทอดความรู้ด้านการกำกับดูแลกิจการที่ดีที่ดำเนินการแล้วเสร็จ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 66,
      "name": "ร้อยละความสำเร็จของการจัดทำแผนแม่บทการกำกับดูแลกิจการที่ดี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 67,
      "name": "ความพร้อมใช้ (Availability) ของการให้บริการระบบสารสนเทศและระบบเครือข่าย ไม่น้อยกว่าร้อยละ 95",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 68,
      "name": "จัดทำร่างบันทึกข้อตกลงแล้วเสร็จภายในระยะเวลาที่กำหนด",
      "cal_type": "ชุด"
    },
    {
      "id": 69,
      "name": "จำนวนข้อมูล/บทความ/บทวิเคราะห์/งานวิจัย/",
      "cal_type": "ฉบับ"
    },
    {
      "id": 70,
      "name": "จำนวนรายงาน/เอกสาร/ผลการศึกษา",
      "cal_type": "ฉบับ"
    },
    {
      "id": 71,
      "name": "จำนวนรายงานการบำรุงรักษาระบบสารสนเทศและระบบเครือข่าย",
      "cal_type": "ฉบับ"
    },
    {
      "id": 72,
      "name": "จำนวนรายงานผลการดำเนินงานที่ผ่านความเห็นชอบของคณะกรรมการบริหารองค์กร",
      "cal_type": "ฉบับ"
    },
    {
      "id": 73,
      "name": "จำนวนข้อมูลประมาณการณสถิติท่องเที่ยว / รายงานสถานการณ์ท่องเที่ยว",
      "cal_type": "ฉบับ"
    },
    {
      "id": 74,
      "name": "จำนวนครั้งในการซ้อมแผนบริหารความต่อเนื่องทางธุรกิจ ของ ททท.",
      "cal_type": "ครั้ง"
    },
    {
      "id": 75,
      "name": "จำนวนครั้งในการกู้คืนระบบภายในระยะเวลา RTO ที่กำหนด",
      "cal_type": "ครั้ง"
    },
    {
      "id": 76,
      "name": "จำนวนครั้งในการจัดกิจกรรม",
      "cal_type": "ครั้ง"
    },
    {
      "id": 77,
      "name": "จำนวนครั้งในการจัดหรือเข้าร่วมประชุม/อบรม/สัมมนา",
      "cal_type": "ครั้ง"
    },
    {
      "id": 78,
      "name": "จำนวนครั้งในการจัดหรือเข้าร่วมประชุม/อบรม/สัมมนา (รายไตรมาส)",
      "cal_type": "ครั้ง"
    },
    {
      "id": 79,
      "name": "จำนวนครั้งในการจัดประชุมคณะอนุกรรมการ / คณะกรรมการตรวจสอบ (รายไตรมาส)",
      "cal_type": "ครั้ง"
    },
    {
      "id": 80,
      "name": "จำนวนครั้งในการตรวจสอบระบบเทคโนโลยีสารสนเทศ",
      "cal_type": "ครั้ง"
    },
    {
      "id": 81,
      "name": "จำนวนครั้งในการให้ความรู้ / ให้คำแนะนำ/ให้ข้อเสนอแนะ",
      "cal_type": "ครั้ง"
    },
    {
      "id": 82,
      "name": "จำนวนคู่มือ/แนวทาง",
      "cal_type": "ชุด"
    },
    {
      "id": 83,
      "name": "จำนวนเจ้าหน้าที่ให้บริการ/ตรวจสอบและแก้ไขปัญหา/ดูแลระบบ",
      "cal_type": "คน"
    },
    {
      "id": 84,
      "name": "จำนวนช่องทางในการสื่อสาร",
      "cal_type": "ช่องทาง"
    },
    {
      "id": 85,
      "name": "จำนวนชั่วโมงการเข้ารับการอบรมต่อคน",
      "cal_type": "ชั่วโมง"
    },
    {
      "id": 86,
      "name": "จำนวนผู้เข้าร่วมกิจกรรม/ประชุม/อบรม/สัมมนา",
      "cal_type": "คน"
    },
    {
      "id": 87,
      "name": "จำนวนผู้ดูแลทรัพย์สินของ ททท.",
      "cal_type": "คน"
    },
    {
      "id": 88,
      "name": "จำนวนระบบสารสนเทศและอุปกรณ์ที่ได้รับการปรับปรุง/พัฒนา",
      "cal_type": "ระบบ"
    },
    {
      "id": 89,
      "name": "จำนวนสถานที่สำรองพร้อมอุปกรณ์สนับสนุน",
      "cal_type": "แห่ง"
    },
    {
      "id": 90,
      "name": "จำนวนเหตุการณ์ (Incident) ระดับร้ายแรงที่เกิดจากปัจจัยภายในที่ควบคุมได้",
      "cal_type": "เหตุการณ์"
    },
    {
      "id": 91,
      "name": "ททท. มีการจัดประชุม อบรม กิจกรรม ภายในระยะเวลาที่กำหนด",
      "cal_type": "ครั้ง"
    },
    {
      "id": 92,
      "name": "ร้อยละของคณะกรรมการที่ได้รับการแต่งตั้งใหม่เข้ารับฟังการบรรยายเตรียมความพร้อมฯ",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 93,
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนเสริมสร้างความผูกพันของบุคลากรต่อองค์กร",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 94,
      "name": "ร้อยละของบุคลากรรับรู้และเข้าใจทิศทางการดำเนินงานในแผนปฏิบัติการประจำปี",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 95,
      "name": "ร้อยละของโปรแกรมระบบห้องสมุดและอิเล็กทรอนิกส์ที่สามารถใช้งานได้",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 96,
      "name": "ร้อยละของบุคลากร ททท. ที่เข้ารับการอบรมผ่านการอบรม",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 97,
      "name": "ระยะเวลาในการเก็บข้อมูลจราจรทางคอมพิวเตอร์ตามที่ พรบ. ว่าด้วยการกระทำผิดทางคอมพิวเตอร์ พ.ศ. 2560 กำหนด",
      "cal_type": "วัน"
    },
    {
      "id": 98,
      "name": "ททท. มีการสอบคัดเลือกพนักงานระดับบริหารแล้วเสร็จภายในระยะเวลาที่กำหนด",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 99,
      "name": "ร้อยละของคณะกรรมการ ททท ที่เข้ารับการอบรม ผ่านการอบรมตามเกณฑ์ของหลักสูตร",
      "cal_type": "ร้อยละ"
    },
    {
      "id": 100,
      "name": "ดำเนินการตามกระบวนการจัดซื้อจัดจ้างแล้วเสร็จภายในระยะเวลาที่กำหนด",
      "cal_type": "ร้อยละ"
    }
  ]

  static projectindicator = [

    {
      "name": "คะแนนประเมินรัฐวิสาหกิจ",
      "calType": "คะแนน"
    },
    {
      "name": "คะแนนประเมิน Core Business Enablers",
      "calType": "คะแนน"
    },
    {
      "name": "คะแนน Digital Maturity Level",
      "calType": "คะแนน"
    },
    {
      "name": "สัดส่วนจำนวนของแผนงานที่สำคัญขององค์กรที่สามารถดำเนินงานได้ตามเป้าหมาย",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการพัฒนาแพลตฟอร์มกลางสำหรับระบบสารสนเทศและข้อมูลของหน่วยงานที่เกี่ยวข้อง\nให้สามารถทำงานและประมวลผลร่วมกัน",
      "calType": "ร้อยละ"
    },
    {
      "name": "คะแนนประเมินสมรรถนะ (Competency)",
      "calType": "ร้อยละ"
    },
    {
      "name": "Emplyee Net Promoter Score ไม่น้อยกว่า",
      "calType": "ร้อยละ"
    },
    {
      "name": "ค่าใช้จ่ายที่ลดลงจากการใช้นวัตกรรม/เทคโนโลยี",
      "calType": "บาท"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนปฏิบัติการดิจิทัลของ ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "สัดส่วนจำนวนกระบวนการที่ดำเนินการได้ตาม SLA",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละจำนวนแผนงาน/โครงการที่ร่วมกับหน่วยงานภายนอกสำเร็จ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ระดับความพึงพอใจของผู้มีส่วนได้ส่วนเสีย ไม่ต่ำกว่า 4 คะแนน",
      "calType": "คะแนน"
    },
    {
      "name": "ระดับความสำเร็จของการดำเนินงานด้าน Eco-efficiency",
      "calType": "ระดับ"
    },
    {
      "name": "คะแนนประเมิน Core Business Enablers ด้าน CG SP RM และ IA",
      "calType": "คะแนน"
    },
    {
      "name": "ระดับความพึงพอใจต่อการใช้ข้อมูลและการใช้ระบบด้านการท่องเที่ยวและระบบคลังข้อมูลของผู้มีส่วนได้ส่วนเสีย",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละความสำเร็จของการบริหารจัดการข้อมูลด้านการท่องเที่ยวและระบบคลังข้อมูลของ ททท. ตามเป้าหมาย\nที่วางไว้ในแต่ละปี",
      "calType": "ร้อยละ"
    },
    {
      "name": "ระดับความพึงพอใจของผู้ใช้ข้อมูลภายนอก",
      "calType": "คะแนน"
    },
    {
      "name": "ระดับความพึงพอใจของผู้ใช้ข้อมูลภายใน ททท.",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละความสำเร็จของโครงการ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละของจำนวนโครงการที่ดำเนินงานได้ตามแผนการลงทุนเพื่อพัฒนายกระดับการท่องเที่ยว",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จในการวางแผนการลงทุนเพื่อพัฒนายกระดับการท่องเที่ยว",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละ 100 ของตำแหน่งสำคัญที่พิจารณาคัดเลือกและแต่งตั้งจากบุคลากรที่เป็น Successor",
      "calType": "ร้อยละ"
    },
    {
      "name": "คะแนนประเมิน Core Business Enablers ด้านการบริหารทุนมนุษย์",
      "calType": "คะแนน"
    },
    {
      "name": "คะแนนประเมิน Core Business Enablers ด้านการจัดการความรู้",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละของจำนวนบุคลากรที่ดำเนินการตามแผนพัฒนาบุคลากรรายบุคคล (IDP)",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนบริหารและพัฒนาด้านทรัพยากรบุคคล ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการจัดการความรู้ ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "คะแนนประเมิน Core Business Enablers ด้านการพัฒนาเทคโนโลยีดิจิทัล",
      "calType": "คะแนน"
    },
    {
      "name": "ททท. ผ่านการตรวจประเมินเพื่อติดตามการรักษามาตรฐาน ISO 27001: 2013",
      "calType": "ระบบ"
    },
    {
      "name": "ร้อยละความสำเร็จของการทบทวนแผนปฏิบัติการดิจิทัลของ ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนการปรับปรุงที่ได้ผลจากการทบทวนบทบาท หน้าที่ ความรับผิดชอบ และอัตรากำลัง",
      "calType": "ร้อยละ"
    },
    {
      "name": "จำนวนนวัตกรรมที่นำมาใช้จริง",
      "calType": "ชิ้น"
    },
    {
      "name": "คะแนนประเมิน Core Business Enablers ด้านการบริหารจัดการนวัตกรรม",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละความสำเร็จในการปรับปรุงกระบวนการทำงาน",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จในการศึกษาและ/หรือทบทวนบทบาท หน้าที่ ความรับผิดชอบ และ อัตรากำลัง",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการจัดทำ SLA ของกระบวนการสำคัญ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการเสริมสร้างนวัตกรรมทางการท่องเที่ยว",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทแลแผนปฏิบัติการสื่อสารภายในองค์กร",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนด้านความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมระยะยาว",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามโครงการตามแผนองค์กรสมรรถนะสูง (HPO)",
      "calType": "ร้อยละ"
    },
    {
      "name": "คะแนนประเมินผลสมรรถนะในระดับองค์กร (HPO)",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละความสำเร็จของการจัดทำแผนองค์กรสมรรถนะสูง",
      "calType": "ร้อยละ"
    },
    {
      "name": "ระดับความพึงพอใจของผู้มีส่วนได้ส่วนเสียที่ดำเนินแผนงาน/โครงการร่วมกับ ททท.",
      "calType": "คะแนน"
    },
    {
      "name": "คะแนนประเมินผล Core Business Enabler (ด้านการมุ่งเน้นผู้มีส่วนได้ส่วนเสีย)",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนยุทธศาสตร์ด้านผู้มีส่วนได้ส่วนเสียระยะยาว",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละการรับรู้ของหน่วยงานภายในเกี่ยวกับแผนยุทธศาสตร์ด้านผู้มีส่วนได้ส่วนเสียระยะยาว",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราการรับรู้ภาพลักษณ์ขององค์กรในฐานะหน่วยงานที่มีความรับผิดชอบต่อสังคมและสิ่งแวดล้อม (กลุ่มผู้มีส่วนได้ส่วนเสีย)",
      "calType": "ร้อยละ"
    },
    {
      "name": "ระดับความต้องการเข้ามามีส่วนร่วมในการดำเนินงานที่รับผิดชอบต่อสังคมและสิ่งแวดล้อมของบุคลากรภายในองค์กร",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการแสดงความรับผิดชอบต่อสังคม",
      "calType": "ร้อยละ"
    },
    {
      "name": "จำนวนผู้เข้าร่วมกิจกรรม CSR กับ ททท.",
      "calType": "คน-ครั้ง"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนของโครงการที่สำคัญ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการจัดทำแผนปฏิบัติการของ ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละจำนวนบุคลากร ททท. ที่มีความรู้ความเข้าใจในเรื่องการบริหารความเสี่ยงและควบคุมภายใน",
      "calType": "ร้อยละ"
    },
    {
      "name": "ททท. ผ่านการตรวจประเมินเพื่อติดตามการรักษามาตรฐานระบบ ISO 22301",
      "calType": "ระบบ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนตรวจสอบเชิงกลยุทธ์และแผนตรวจสอบประจำปี",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผน Governance, Risk & Compliance (GRC)",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละการดำเนินงานตามแผนการบริหารความเสี่ยงและควบคุมภายใน",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละจำนวนกิจกรรมการถ่ายทอดความรู้ด้านการบริหารความเสี่ยงและควบคุมภายในที่ดำเนินการแล้วเสร็จ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละจำนวนหน่วยงานที่ดำเนินการซ้อมแผนบริหารความต่อเนื่องทางธุรกิจสำเร็จ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการจัดทำ/ทบทวนแผนบริหารความเสี่ยงและควบคุมภายใน",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการจัดทำแผนตรวจสอบเชิงกลยุทธ์ และแผนตรวจสอบประจำปี",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละจำนวนบุคลากร ททท. ที่มีความรู้ความเข้าใจในเรื่องการกำกับดูแลกิจการที่ดี",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนแม่บทการกำกับดูแลกิจการที่ดี",
      "calType": "ร้อยละ"
    },
    {
      "name": "คะแนนการประเมินคุณธรรม และความโปร่งใสในการดำเนินงาน ของ ททท. (ITA)",
      "calType": "คะแนน"
    },
    {
      "name": "ร้อยละจำนวนกิจกรรมการถ่ายทอดความรู้ด้านการกำกับดูแลกิจการที่ดีที่ดำเนินการแล้วเสร็จ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความสำเร็จของการจัดทำแผนแม่บทการกำกับดูแลกิจการที่ดี",
      "calType": "ร้อยละ"
    },
    {
      "name": "คะแนน Digital Literacy",
      "calType": "คะแนน"
    },
    {
      "name": "จำนวนแผนที่ผ่านความเห็นชอบของคณะกรรมการบริหารองค์กร",
      "calType": "แผน"
    },
    {
      "name": "จำนวนแผนที่ผ่านความเห็นชอบจากคณะกรรมการตรวจสอบ",
      "calType": "แผน"
    },
    {
      "name": "จำนวนพันธมิตร",
      "calType": "ราย"
    },
    {
      "name": "จำนวนระบบสารสนเทศและอุปกรณ์ที่ได้รับการปรับปรุง/พัฒนา",
      "calType": "ระบบ"
    },
    {
      "name": "จำนวนสถานที่สำรองพร้อมอุปกรณ์สนับสนุน",
      "calType": "สถานที่"
    },
    {
      "name": "ททท. มีแผนที่ผ่านความเห็นชอบของคณะกรรมการบริหารองค์กร",
      "calType": "ฉบับ"
    },
    {
      "name": "ททท. มีแผนที่ผ่านความเห็นชอบจากคณะกรรมการตรวจสอบ",
      "calType": "ฉบับ"
    },
    {
      "name": "ททท. มีแผน/รายงานที่ผ่านความเห็นชอบจากคณะกรรมการ ททท.",
      "calType": "ฉบับ"
    },
    {
      "name": "ททท. มีแผน/รายงานที่ผ่านความเห็นชอบจากคณะอนุกรรมการ ททท.",
      "calType": "ฉบับ"
    },
    {
      "name": "ททท. มีแผน/รายงานที่ผ่านความเห็นชอบจากคณะกรรมการ HR",
      "calType": "ฉบับ"
    },
    {
      "name": "ททท. มีแผน/รายงานที่ผ่านความเห็นชอบจากคณะกรรมการตรวจสอบ",
      "calType": "ฉบับ"
    },
    {
      "name": "ททท. สำนักงานสาขาในประเทศ ได้รับการสำรวจพร้อมการให้คำแนะนำด้านความปลอดภัย อาชีวอนามัยฯ",
      "calType": "แห่ง"
    },
    {
      "name": "ททท. สำนักงานใหญ่ผ่านเกณฑ์การฝึกอบรมเชิงปฏิบัติการ เรื่องการป้องกันอัคคีภัย การซ้อมดับเพลิง และการอพยพหนีไฟตามที่กฎหมายกำหนด",
      "calType": "ผ่าน"
    },
    {
      "name": "ธุรกิจที่ ททท. ร่วมลงทุนมีผลประกอบการดีขึ้น",
      "calType": "บาท"
    },
    {
      "name": "รายงานความคืบหน้าการกำกับดูแลธุรกิจที่ ททท. ร่วมลงทุนให้แก่คณะกรรมการ ททท. (รายเดือน)",
      "calType": "ฉบับ"
    },
    {
      "name": "ร้อยละของกลุ่มเป้าหมายมีความรู้ความเข้าใจจากการอบรมเพิ่มขึ้น",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละของคณะกรรมการ ททท. ที่เข้าร่วมโครงการฯ มีความรู้ความเข้าใจในภาพรวมของการเพิ่มประสิทธิภาพการกำกับดูแลการดำเนินงานของ ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละความผูกพันของบุคลากร",
      "calType": "ร้อยละ"
    },
    {
      "name": "ร้อยละของบุคลากรที่มีคะแนนประเมินพฤติกรรมตามค่านิยมองค์กรในระดับ 4 คะแนนขึ้นไป",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราการรับรู้นโยบาย/แนวปฏิบัติการกำกับดูแลด้านการบริหารจัดการเทคโนโลยีดิจิทัลของบุคลากรภายในองค์กร",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราการรับรู้เนื้อหาสำคัญที่สื่อสาร",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราความพึงพอใจของคณะกรรมการ ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราความพึงพอใจของบุคลากร ททท.",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราความพึงพอใจของผู้เข้าร่วมกิจกรรม / ผู้เข้าร่วมอบรม",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราความพึงพอใจของผู้ใช้บริการ",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราความพึงพอใจของผู้ใช้งานระบบเครือข่ายและอุปกรณ์",
      "calType": "ร้อยละ"
    },
    {
      "name": "อัตราความพึงพอใจของผู้ใช้งานระบบสารสนเทศ",
      "calType": "ร้อยละ"
    },
    {
      "name": "ระดับความพึงพอใจของหน่วยรับตรวจ",
      "calType": "คะแนน"
    },
    {
      "name": "ผลการประเมินระบบและการทำงานของ HR Team จากผู้บริหารและพนักงานต่อการเป็น HR Strategic Partner",
      "calType": "ร้อยละ"
    },
    {
      "name": "ททท. มีรายงานผลการศึกษาโครงสร้างองค์กรเพื่อรองรับการเปลี่ยนแปลงของดิจิทัลเทคโนโลยี ที่ผ่านความเห็นชอบของคณะกรรมการ ททท.",
      "calType": "ฉบับ"
    },
    {
      "name": "ร้อยละความสำเร็จของการดำเนินงานตามแผนเสริมสร้างความผูกพันของบุคลากรต่อองค์กร",
      "calType": "ร้อยละ"
    }
  ]

  static active_area = [
    {
      "id": 1,
      "name": "สถาบันการศึกษาในประเทศไทย"
    },
    {
      "id": 2,
      "name": "กรุงเทพมหานคร และปริมณฑล"
    },
    {
      "id": 3,
      "name": "ททท.ส่วนกลาง"
    },
    {
      "id": 4,
      "name": "ททท.สำนักงานสาขาต่างประเทศ"
    },
    {
      "id": 5,
      "name": "ททท.สำนักงานสาขาในประเทศ"
    },
    {
      "id": 6,
      "name": "ภาคกลาง"
    },
    {
      "id": 7,
      "name": "ภาคตะวันออก"
    },
    {
      "id": 8,
      "name": "ภาคตะวันออกเฉียงเหนือ"
    },
    {
      "id": 9,
      "name": "ภาคใต้"
    },
    {
      "id": 10,
      "name": "ภาคเหนือ"
    },
    {
      "id": 11,
      "name": "ภูมิภาคต่างประเทศ"
    },
    {
      "id": 12,
      "name": "ภูมิภาคในประเทศ"
    },
    {
      "id": 13,
      "name": "ภูมิภาคยุโรป แอฟริกา และตะวันออกกลาง"
    },
    {
      "id": 14,
      "name": "ภูมิภาคอเมริกา"
    },
    {
      "id": 15,
      "name": "ภูมิภาคอาเซียน เอเชียใต้และแปซิฟิกใต้"
    },
    {
      "id": 16,
      "name": "ภูมิภาคเอเชียตะวันออก"
    }
  ]

  static stake_holder = [
    {
      "id": 1,
      "name": "คณะกรรมการ ททท."
    },
    {
      "id": 2,
      "name": "คณะกรรมการความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมในการทำงาน"
    },
    {
      "id": 3,
      "name": "คณะกรรมการตรวจสอบ ททท."
    },
    {
      "id": 4,
      "name": "คณะกรรมการอำนวยการศูนย์ปฏิบัติการในภาวะภัยพิบัติ"
    },
    {
      "id": 5,
      "name": "คณะอนุกรรมการกำกับดูแลกิจการที่ดีและการแสดงความรับผิดชอบต่อสังคม"
    },
    {
      "id": 6,
      "name": "คณะอนุกรรมการบริหารความเสี่ยงและควบคุมภายในของ ททท."
    },
    {
      "id": 7,
      "name": "เจ้าหน้าที่พัสดุ"
    },
    {
      "id": 8,
      "name": "ชุมชน"
    },
    {
      "id": 9,
      "name": "บริษัทผู้รับจ้างดำเนินโครงการ"
    },
    {
      "id": 10,
      "name": "บุคคลทั่วไป"
    },
    {
      "id": 11,
      "name": "ผู้เข้าปฏิบัติงานใหม่"
    },
    {
      "id": 12,
      "name": "ผู้ได้รับการแต่งตั้งไปดำรงตำแหน่ง ณ สำนักงานต่างประเทศและในประเทศ"
    },
    {
      "id": 13,
      "name": "ผู้บริหาร ททท."
    },
    {
      "id": 14,
      "name": "ผู้ประกอบธุรกิจท่องเที่ยว"
    },
    {
      "id": 15,
      "name": "พนักงาน ททท.ส่วนกลาง"
    },
    {
      "id": 16,
      "name": "พนักงาน ททท. สำนักงานสาขาต่างประเทศ"
    },
    {
      "id": 17,
      "name": "พนักงาน ททท. สำนักงานสาขาในประเทศ"
    },
    {
      "id": 18,
      "name": "ลูกจ้าง ททท. ส่วนกลาง"
    },
    {
      "id": 19,
      "name": "ลูกจ้าง ททท. สำนักงานสาขาในประเทศ"
    },
    {
      "id": 20,
      "name": "หน่วยงานภาครัฐ"
    },
    {
      "id": 21,
      "name": "หน่วยงานภาคเอกชน"
    },
    {
      "id": 22,
      "name": "พนักงาน ททท. ระดับ 6 ที่ยังไม่เคยผ่านการอบรมหลักสูตรการเตรียมนักบริหารระดับต้น"
    },
    {
      "id": 23,
      "name": "- พนักงาน ททท. ระดับ 7 ที่ยังไม่เคยผ่านการอบรมหลักสูตรการเตรียมนักบริหารระดับกลาง"
    },
    {
      "id": 24,
      "name": "- พนักงาน ททท. ระดับ 8 ที่ยังไม่เคยผ่านการอบรมหลักสูตรการเตรียมนักบริหารระดับสูง"
    },
    {
      "id": 25,
      "name": "- คณะกรรมการด้านทรัพยากรบุคคล"
    },
    {
      "id": 26,
      "name": "- คณะกรรมการบริหารองค์กร"
    },
    {
      "id": 27,
      "name": "- บุคคลที่ขึ้นบัญชีฯ ไว้กับ ททท."
    },
    {
      "id": 28,
      "name": "- ผู้ผ่านการสอบคัดเลือกและได้บรรจุเป็นพนักงาน ททท."
    },
    {
      "id": 29,
      "name": "- พนักงานระดับ 6 พนักงานระดับ 7 และพนักงานระดับ 8 ที่มีคุณสมบัติตามที่ ททท. กำหนด"
    },
    {
      "id": 30,
      "name": "- คณะทำงาน HR Audit"
    },
    {
      "id": 31,
      "name": "- คณะกรรมการคัดเลือกบุคคลเพื่อบรรจุเป็นพนักงาน ททท."
    },
    {
      "id": 32,
      "name": "- คณะกรรมการกิจการสัมพันธ์"
    },
    {
      "id": 33,
      "name": "- คณะอนุกรรมการขับเคลื่อนวัตกรรมองค์กร"
    },
    {
      "id": 34,
      "name": "- ผู้มีส่วนได้ส่วนเสียภายนอก"
    },
    {
      "id": 35,
      "name": "- ผู้มีส่วนได้ส่วนเสียภายใน"
    },
    {
      "id": 36,
      "name": "- Start Up"
    },
    {
      "id": 37,
      "name": "- คณะทำงานการจัดการด้านนวัตกรรมองค์กร"
    },
    {
      "id": 38,
      "name": "- หน่วยงานในพื้นที่ที่ดำเนินกิจกรรม CSR"
    },
    {
      "id": 39,
      "name": "- พนักงานกลุ่ม Successor"
    },
    {
      "id": 40,
      "name": "- พนักงานกลุ่ม Talent"
    }
  ]

}

export default MasterData